#include "iocc2530.h"
#include "led_key.h"

/*
@led init：对LED进行初始化
@retval:none 
@note:LED对应的引脚是P10和P11，初始化为普通IO，输出模式
*/
void led_init(void)
{
    P1SEL &= 0xfc;  //1111 1100  把P1_0和P1_1设置为通IO模式
    P1DIR |= 0x03;  //0000 0011  把P1_0和P1_1设置为输出模式
    P1_0 = 1;
    P1_1 = 1;
}

/*
@led ctr1：对LED的状态进行控的函数
@led num：指定对哪一盏LED等进行控制，可选择为LEDO,LED1
@led state：指定LED的状态，可选择为 LED ON, LED OFF 
@retval：none
*/
void led_ctrl(int led_num,int led_state)
{
    switch(led_num)
    {
    case LED0:
        P1_0 = led_state;
        break;
    case LED1:
        P1_1 = led_state;
        break;
    }
}

void beep_init(void)
{
    //P0_6上拉输出
    P0SEL &= ~(1<<6);  //1111 1100  把P0_6设置为通IO模式
    P0DIR |= 1<<6;  //0100 0000  把P0_6设置为输出模式
    P0_6 = 1;
    
    //P0_5 霍尔元件，输入
    P0SEL &= ~(1<<5);   // 1110 1101 把P05设置为普通IO模式
    P0DIR &= ~(1<<5);   // 1111 1101 把P05设置为输入模式
    P0INP &= ~(1<<5);   // 1110 1111 把P05设置为上下拉模式
    P2INP |= (1<<5);   // 1101 1111 把P0组设置为下拉模式
    P0_5 = 1;
    
    //P0_7上拉输出，继电器
    P0SEL &= ~(1<<7);  //1111 1100  把P0_6设置为通IO模式
    P0DIR |= 1<<7;  //0100 0000  把P0_6设置为输出模式
    P0_7 = 1;
    
    
    //P1_2 R灯，输入
    P1SEL &= ~(1<<2);   // 1110 1101 把P05设置为普通IO模式
    P1DIR &= ~(1<<2);   // 1111 1101 把P05设置为输入模式
    P1INP &= ~(1<<2);   // 1110 1111 把P05设置为上下拉模式
    P2INP |= (1<<6);   // 1101 1111 把P0组设置为下拉模式
    P1_2 = 0;
    
    
    //P1_3 G灯，输入
    P1SEL &= ~(1<<3);   // 1110 1101 把P05设置为普通IO模式
    P1DIR &= ~(1<<3);   // 1111 1101 把P05设置为输入模式
    P1INP &= ~(1<<3);   // 1110 1111 把P05设置为上下拉模式
    P2INP |= (1<<6);   // 1101 1111 把P0组设置为下拉模式
    P1_3 = 0;
    
    //P1_7 B灯，输入
    P1SEL &= ~(1<<7);   // 1110 1101 把P05设置为普通IO模式
    P1DIR &= ~(1<<7);   // 1111 1101 把P05设置为输入模式
    P1INP &= ~(1<<7);   // 1110 1111 把P05设置为上下拉模式
    P2INP |= (1<<6);   // 1101 1111 把P0组设置为下拉模式
    P1_7 = 0;
    
    //P1_4 一键报警，输入
    P1SEL &= ~(1<<4);   // 1110 1101 把P05设置为普通IO模式
    P1DIR &= ~(1<<4);   // 1111 1101 把P05设置为输入模式
    P1INP &= ~(1<<4);   // 1110 1111 把P05设置为上下拉模式
    P2INP |= (1<<6);   // 1101 1111 把P0组设置为下拉模式
    P1_4 = 0;
}

